const t={map:'[{"编程踩坑积累与总结":["0.0","2.0","3.0","7.0","14.0","15.0","17.0"],"test1":["1.0"],"testdddd":["4.0"],"移动端响应式":["5.0"],"响应式布局常用方法":["5.1"],"css":["6.0"],"水平布局":["6.1"],"文本":["6.2"],"单个块级元素":["6.3"],"多个块级元素":["6.4"],"使用绝对定位":["6.5"],"任意个元素":["6.6","6.11"],"垂直居中":["6.7"],"单行":["6.8"],"多行文本":["6.9"],"单个块元素":["6.10"],"水平垂直居中":["6.12"],"行内":["6.13"],"tabel":["6.14"],"绝对定位":["6.15","6.21"],"绝对居中":["6.16"],"flex":["6.17","6.22","6.24","6.27"],"两列布局":["6.18"],"float":["6.19","6.20","6.23","6.26"],"三列布局":["6.25"],"h5":["9.0"],"src":["10.0"],"对语义化的理解":["11.0"],"你是怎么理解语义化的":["11.1"],"常见的语义化标签有哪些":["11.2"],"面试":["12.0"],"数组":["13.0"],"测试":["16.0","18.0"]},{"0":["6.3"],"1":["16.0","18.0"],"tip":["0.0","2.0","3.0","7.0","12.0","14.0","15.0","17.0"],"什么是响应式":["5.0"],"响应式就是将界面设计成能够适应不同的设备":["5.0"],"如果将屏幕看成是容器":["5.0"],"使用":["5.1","6.10"],"vm":["5.1"],"定制":["5.1"],"rem":["5.1"],"自适应布局":["5.1"],"移动端使用":["5.1"],"布局需要通过":["5.1"],"js":["5.1"],"设置不同屏幕宽高比的":["5.1"],"font":["5.1"],"size":["5.1"],"结合":["5.1"],"单位和":["5.1"],"calc":["5.1"],"常见布局":["6.0"],"行内元素":["6.2","6.9"],"行内块级元素":["6.2","6.9"],"margin":["6.3","6.19","6.26"],"css":["6.4","6.5","6.6","6.9","6.10","6.11","6.13","6.14","6.15","6.16","6.17","6.19"],"parent":["6.4","6.5","6.10","6.11","6.14","6.15","6.16","6.17","6.21","6.22","6.24","6.26","6.27"],"height":["6.5"],"200px":["6.5"],"width":["6.5"],"定宽":["6.5"],"行内":["6.8"],"行内块":["6.8"],"display":["6.10","6.11","6.17"],"table":["6.10"],"cell":["6.10","6.14"],"vertical":["6.10"],"align":["6.10"],"middle":["6.10"],"使用绝对定位":["6.10"],"flex":["6.10"],"原理":["6.10"],"子绝父相":["6.10"],"行内块级":["6.13"],"图片":["6.13"],"左列定宽":["6.18","6.26"],"body":["6.19","6.20","6.21","6.22","6.23","6.24","6.26","6.27"],"div":["6.19","6.20","6.21","6.22","6.23","6.24","6.26","6.27"],"overflow":["6.20","6.23"],"html":["6.20","6.21","6.22","6.23","6.24","6.26","6.27","11.1"],"id":["6.21","6.22","6.23","6.24","6.26","6.27"],"两列定宽":["6.25"],"left":["6.26"],"center":["6.26"],"中间定宽":["6.26"],"新特性":["9.0"],"为了更好的实现语义化":["9.0"],"新增了":["9.0"],"header":["9.0","11.2"],"用于替换的当前元素":["10.0"],"用于指定外部资源的地址":["10.0"],"通常用于引入外部文件":["10.0"],"如图片":["10.0"],"音频":["10.0"],"视频":["10.0"],"语义化的好处":["11.1"],"我认为":["11.1"],"语义化主要指的是我们应该用合适的标签来划分网页内容的结构":["11.1"],"的本质作用其实就是定义网页内容的结构":["11.1"],"页眉":["11.2"],"网站标题":["11.2"]},{"10":["6.26"],"100":["6.26"],"200":["6.26"],"这里主要记录后端知识点":["0.0"],"这里主要记录突发奇想":["2.0"],"这里主要记录框架相关知识点":["3.0"],"那么内容就像水一样":["5.0"],"为什么要设计响应式":["5.0"],"首先":["5.0"],"可以脱离":["5.1"],"的控制":["5.1"],"适用于":["5.1"],"布局":["5.1"],"nth":["5.1"],"child":["5.1"],"选择指定元素":["5.1"],"通过":["5.1"],"筛选指定的元素设置样式":["5.1"],"适用于表格着色":["5.1"],"边界元素排版":["5.1"],"使用":["6.2"],"text":["6.2","6.4"],"align":["6.2","6.4","6.11"],"auto":["6.3","6.17"],"必须定宽":["6.3"],"优点":["6.3"],"center":["6.4","6.27"],"position":["6.5","6.10","6.15","6.16"],"relative":["6.5","6.10","6.15","6.16"],"父相":["6.5","6.10"],"background":["6.5"],"color":["6.5"],"f00":["6.5"],"son":["6.5","6.15","6.16","6.17"],"parent":["6.6","6.8","6.9","6.13","6.23"],"display":["6.6"],"css":["6.8","6.26"],"或者用span把所有文字包裹起来":["6.9"],"设置display":["6.9"],"top":["6.10"],"right":["6.10","6.21","6.26"],"bottom":["6.10"],"left":["6.10","6.19","6.20","6.21","6.22","6.23","6.24","6.27"],"的值是相对于父元素尺寸的":["6.10"],"然后":["6.10"],"margin":["6.10","6.17"],"或者":["6.10"],"transform":["6.10"],"是相对于自身尺寸的":["6.10"],"组合使用达到水平居中的目的":["6.10"],"height":["6.10","6.13","6.14"],"150px":["6.10","6.13","6.14"],"flex":["6.11"],"items":["6.11"],"width":["6.14","6.26"],"右列自适应":["6.18","6.26"],"id":["6.19","6.20"],"左列定宽":["6.19","6.20","6.21","6.22","6.27"],"左列不定宽":["6.23","6.24"],"一列自适应":["6.25"],"min":["6.26"],"310px":["6.26"],"防止宽度不够":["6.26"],"子元素换行":["6.26"],"10px":["6.26"],"中间定宽":["6.27"],"这里主要记录前端基础知识":["7.0"],"footer":["9.0"],"nav":["9.0","11.2"],"aside":["9.0"],"article":["9.0"],"脚本等":["10.0"],"指向的内容会嵌入到文档中当前标签所在的位置":["10.0"],"常用于":["10.0"],"img":["10.0"],"script":["10.0"],"iframe":["10.0"],"audio":["10.0"],"video":["10.0"],"一个语义化的文档":["11.1"],"能够使页面的结构更加清晰":["11.1"],"易于理解":["11.1"],"这样不仅有利于开发者的阅读和理解":["11.1"],"同时也能够使机器对文档内容进行正确的解读":["11.1"],"比如说我们常用的":["11.1"],"导航菜单等":["11.2"],"导航部分":["11.2"],"通常包含网站的主要导航链接":["11.2"],"面试题总结与归纳":["12.0"],"这里主要记录编程遇到的问题":["14.0"],"这里主要记录项目中的关键技术":["15.0"],"这里主要记录面试遇到的真题":["17.0"]},{"50":["6.5","6.10"],"电脑":["5.0"],"笔记本":["5.0"],"手机":["5.0"],"平板等智能设备在不断增加":["5.0"],"writing":["5.1"],"mode":["5.1"],"排版竖文":["5.1"],"调整文本排版方向":["5.1"],"适用于竖行文字":["5.1"],"文言文":["5.1"],"诗词":["5.1"],"text":["5.1"],"align":["5.1"],"last":["5.1"],"对齐两端文本":["5.1"],"设置文本两端对齐":["5.1"],"center":["6.2","6.11"],"优点":["6.2"],"兼容性比较好":["6.2"],"兼容性好":["6.3"],"缺点":["6.3"],"son":["6.4","6.10"],"display":["6.4","6.14"],"inline":["6.4","6.9"],"absolute":["6.5","6.10","6.15","6.16"],"子绝":["6.5","6.10"],"left":["6.5"],"父元素宽度一半":["6.5"],"这里等同于left":["6.5"],"100px":["6.5","6.26"],"flex":["6.6"],"justify":["6.6"],"height":["6.8","6.9","6.26"],"150px":["6.8","6.9"],"block转换成图片的方式解决":["6.9"],"父元素高度一半":["6.10"],"这里等同于":["6.10"],"75px":["6.10"],"translatey":["6.10"],"自身高度一半":["6.10"],"或":["6.11","6.17"],"line":["6.13"],"行高的值与height相等":["6.13"],"200px":["6.14","6.26"],"table":["6.14"],"top":["6.15"],"margin":["6.16"],"right":["6.19","6.20","6.22","6.23","6.24","6.27"],"右列自适应":["6.19","6.20","6.21","6.22","6.23","6.24","6.27"],"css":["6.21"],"position":["6.21"],"left和":["6.26"],"center间隔":["6.26"],"500px":["6.26"],"background":["6.26"],"color":["6.26"],"f00":["6.26"],"等语义化标签":["9.0"],"为了方便在客户端存储和获取数据":["9.0"],"提供了":["9.0"],"localstorage":["9.0"],"sessionstorage":["9.0"],"等标签":["10.0"],"用于加载外部资源":["10.0"],"当浏览器解析到带有":["10.0"],"属性的标签时":["10.0"],"会立即请求指定地址的资源":["10.0"],"暂停其它资源的下载和处理":["10.0"],"直到将该资源加载":["10.0"],"b":["11.1"],"和":["11.1"],"strong":["11.1"],"标签":["11.1"],"它们在样式上都是文字的加粗":["11.1"],"但是":["11.1"],"main":["11.2"],"主要内容区域":["11.2"],"article":["11.2"],"已经解决方案":["14.0"]},{"50":["6.15"],"100":["6.22"],"其次":["5.0"],"就算是都使用的":["5.0"],"pc":["5.0"],"适用于未知字数中文对齐":["5.1"],"not":["5.1"],"去除无用属性":["5.1"],"排除指定元素不使用样式":["5.1"],"适用于符号分割文字":["5.1"],"object":["5.1"],"fit":["5.1"],"规定图像尺寸":["5.1"],"使图像脱离":["5.1"],"background":["5.1","6.19","6.20"],"缺点":["6.2","6.10"],"只对行内元素有效":["6.2"],"必须顶宽":["6.3"],"值不能为":["6.3"],"block":["6.4"],"改为行内或者行内块级形式":["6.4"],"以达到text":["6.4"],"transform":["6.5"],"translatex":["6.5"],"自身宽度一半":["6.5"],"等同于margin":["6.5"],"50px":["6.5","6.10"],"content":["6.6","6.17"],"center":["6.6","6.13","6.17"],"line":["6.8","6.9"],"30px":["6.9"],"25px":["6.10"],"优缺点":["6.10"],"优点":["6.10"],"兼容性好":["6.10"],"不管是块级还是行内元素都可以实现":["6.10"],"代码较多":["6.10"],"脱离文档流":["6.10"],"需要知道高度值":["6.10"],"son":["6.11"],"text":["6.13"],"align":["6.13","6.14"],"vertical":["6.14"],"middle":["6.14"],"left":["6.15"],"auto":["6.16"],"width":["6.16","6.22"],"100px":["6.16"],"justify":["6.17"],"color":["6.19"],"f00":["6.19"],"css":["6.20","6.22","6.23","6.24","6.27"],"relative":["6.21"],"子绝父相":["6.21"],"absolute":["6.21"],"top":["6.21"],"margin":["6.23"],"display":["6.24","6.27"],"eeff2b":["6.26"],"320px":["6.26"],"等于":["6.26"],"center的宽度之和加上间隔":["6.26"],"多出来的就是":["6.26"],"right和":["6.26"],"center的间隔":["6.26"],"0f0":["6.26"],"height":["6.27"],"500px":["6.27"],"和离线存储":["9.0"],"多媒体方面规定了":["9.0"],"audio":["9.0"],"和":["9.0"],"编译":["10.0"],"执行完毕":["10.0"],"因此":["10.0"],"属性会影响页面的加载和渲染速度":["10.0"],"这也是为什么将":["10.0"],"js":["10.0"],"放在底部而不是头部":["10.0"],"标签具有强调的语义":["11.1"],"对于一般显示":["11.1"],"可能看上去没有什么差异":["11.1"],"但是对于机器来说":["11.1"],"会有很大的不同":["11.1"],"如果用户使用的是屏幕阅读器来访问网页":["11.1"],"内容块":["11.2"],"比如新闻文章":["11.2"],"博客帖子等":["11.2"],"aside":["11.2"],"以便以后回顾或找到更优解":["14.0"]},{"0":["6.10","6.13","6.21"],"端":["5.0"],"用户是否将浏览器全屏也是个问题":["5.0"],"不同屏幕分辨率也不同":["5.0"],"的约束":["5.1"],"img":["5.1"],"来标记图像背景尺寸":["5.1"],"适用于图片尺寸自适应":["5.1"],"overflow":["5.1","6.26"],"x":["5.1"],"排版横向列表":["5.1"],"flexbox":["5.1"],"或":["5.1","6.10"],"inline":["5.1"],"block":["5.1"],"的形式横行排列元素":["5.1"],"且属性会继承":["6.2"],"会影响后代行内内容":["6.2"],"如果子元素宽度大于父元素宽度就会失效":["6.2"],"宽度要小于父元素":["6.3"],"否则无效":["6.3"],"css":["6.3"],"align对其生效":["6.4"],"优点":["6.4","6.6"],"兼容性好":["6.4"],"00ff00":["6.5"],"简单":["6.6"],"与height等值":["6.8"],"元素在页面呈现为5行":["6.9"],"则line":["6.9"],"height的值为height":["6.9"],"兼容性不好":["6.10"],"ie9":["6.10"],"当":["6.10"],"为":["6.10"],"时":["6.10"],"会无限延伸占满空间并且平分":["6.10"],"self":["6.11"],"font":["6.13"],"size":["6.13"],"text":["6.14"],"center":["6.14"],"如果是行内元素就添加这个":["6.14"],"定宽高时等同于margin":["6.15"],"负自身宽度一半":["6.15"],"height":["6.16","6.19","6.22"],"50px":["6.16"],"top":["6.16"],"align":["6.17"],"items":["6.17"],"width":["6.19","6.20","6.21","6.27"],"100px":["6.19","6.27"],"color":["6.20","6.21"],"f00":["6.20","6.21"],"background":["6.21","6.27"],"500px":["6.22"],"display":["6.22"],"10px":["6.23","6.24","6.27"],"只设置浮动":["6.23"],"不设宽度":["6.24"],"margin":["6.24","6.27"],"间距":["6.27"],"video":["9.0"],"canvas":["9.0"],"画布":["9.0"],"拖拽元素":["9.0"],"href":["10.0"],"指向网络资源所在位置":["10.0"],"建立和当前元素或当前文档之间的链接":["10.0"],"a":["10.0"],"link":["10.0"],"area":["10.0"],"使用":["11.1"],"就会有明显的语调上的变化":["11.1"],"标签则没有":["11.1"],"如果是搜索引擎的爬虫对我们的网页进行分析的话":["11.1"],"它会依赖":["11.1"],"侧边栏":["11.2"],"footer":["11.2"],"页脚":["11.2"],"figure":["11.2"]},{"0":["6.14","6.16"],"5":["6.9"],"20":["6.26"],"同一张图片在不同的设备上":["5.0"],"大小可能天差地别":["5.0"],"响应式界面的标准是什么":["5.0"],"同一页面在不同大小和比例上看起来都应该是舒适的":["5.0"],"对父元素设置":["5.1"],"auto":["5.1","6.10"],"横行滚动查看":["5.1"],"适用于横行滚动列表":["5.1"],"元素过多但位置有限的导航栏":["5.1"],"控制文本溢出":["5.1"],"适用于单行文字":["5.1"],"多行文字溢出":["5.1"],"transform":["5.1"],"描绘":["5.1"],"1px":["5.1"],"注意":["6.2"],"只控制行内内容如何相对父元素对齐":["6.2"],"css":["6.2"],"son":["6.3","6.13","6.14"],"width":["6.3"],"缺点":["6.4","6.6","6.9"],"只对行内元素有效":["6.4"],"属性会继承影响到后代行内内容":["6.4"],"子绝父相":["6.5"],"top":["6.5"],"bottom":["6.5","6.16"],"right":["6.5"],"是相对于父元素尺寸的":["6.5"],"margin":["6.5","6.14","6.15"],"容易理解":["6.6"],"优点":["6.8","6.9"],"兼容性好":["6.8","6.9"],"简单":["6.10"],"消除幽灵空白节点的bug":["6.13"],"display":["6.13"],"inline":["6.13"],"负自身高度一半":["6.15"],"500px":["6.19","6.20","6.21","6.23","6.24"],"100px":["6.20","6.21","6.22"],"height":["6.20","6.21","6.23","6.24"],"background":["6.22","6.23","6.24"],"color":["6.22","6.23","6.24","6.27"],"f00":["6.22","6.23","6.24","6.27"],"不设宽度":["6.23"],"webworker":["9.0"],"webscoket":["9.0"],"协议":["9.0"],"新增":["9.0"],"用于定义超链接和外部样式表":["10.0"],"不会立即请求资源":["10.0"],"而是将链接添加到文档的超链接列表中":["10.0"],"当用户点击链接时":["10.0"],"才会根据":["10.0"],"标签来确定上下文和各个关键字的权重":["11.1"],"一个语义化的文档对爬虫来说是友好的":["11.1"],"是有利于爬虫对文档内容解读的":["11.1"],"从而有利于网站的":["11.1"],"seo":["11.1"],"表示一组媒体内容":["11.2"],"一般包括图像":["11.2"],"图表":["11.2"]},{"1":["6.22"],"同一页面在不同分辨率上看起来应该合理":["5.0"],"同一页面在不同操作方式下":["5.0"],"体验应该是统一的":["5.0"],"边框":["5.1"],"适用于容器":["5.1"],"翻转内容":["5.1"],"scale3d":["5.1"],"对内容进行翻转":["5.1"],"适用于内容翻转":["5.1"],"letter":["5.1"],"spacing":["5.1"],"排版倒序文本":["5.1"],"parent":["6.2"],"100px":["6.3","6.14"],"块级元素改为":["6.4"],"或":["6.5"],"是相对于自身尺寸的":["6.5"],"组合使用达到水平居中的目的":["6.5"],"优点":["6.5"],"使用":["6.5"],"pc":["6.6"],"端兼容性不好":["6.6"],"缺点":["6.8"],"只能用于单行行内内容":["6.8"],"只能用于行内内容":["6.9"],"需要知道高度和最终呈现多少行来计算出":["6.9"],"兼容性较好":["6.10"],"ie8":["6.10"],"items":["6.10"],"center":["6.10"],"self":["6.10"],"direction":["6.11"],"column":["6.11"],"justify":["6.11"],"block":["6.13"],"如果是块级元素需改为行内或行内块级才生效":["6.13"],"vertical":["6.13"],"auto":["6.14"],"如果是块级元素就添加这个":["6.14"],"transform":["6.15"],"translate":["6.15"],"left":["6.16"],"right":["6.16"],"0f0":["6.19","6.20","6.22","6.24"],"值大于等于":["6.21"],"left的宽度":["6.21"],"均分了父元素剩余空间":["6.22"],"hidden":["6.23"],"触发bfc":["6.23"],"间隔":["6.26"],"在此定义和":["6.26"],"的间隔":["6.26"],"200px":["6.27"],"eeff2b":["6.27"],"email":["9.0"],"number":["9.0"],"url":["9.0"],"等表单类型":["9.0"],"属性的值请求相应的资源":["10.0"],"如果使用":["10.0"],"来引入":["10.0"],"css":["10.0"],"文件":["10.0"],"会并行下载资源而且不会停止对当前文档的处理":["10.0"],"从":["11.1"],"html5":["11.1"],"可以看出":["11.1"],"标准是倾向于以语义化的方式构建网页的":["11.1"],"比如新增了":["11.1"],"header":["11.1"],"footer":["11.1"],"视频等":["11.2"],"abbr":["11.2"],"缩写词":["11.2"],"address":["11.2"]},{"1":["6.24","6.27"],"同一页面在不同类型的设备上":["5.0"],"交互方式应该是符合习惯的":["5.0"],"设置负值字体间距将文本倒序":["5.1"],"适用于文言文":["5.1"],"margin":["5.1"],"left":["5.1"],"排版左重右轻列表":["5.1"],"横行布局时":["5.1"],"最后一个元素通过设置":["5.1"],"实现向右对齐":["5.1"],"适用于右侧带图标的导航栏":["5.1"],"换行":["6.4"],"空格会产生元素间隔":["6.4"],"兼容性好":["6.5"],"不管是块级还是行内都能实现":["6.5"],"缺点":["6.5"],"代码较多":["6.5"],"脱离文档流":["6.5"],"兼容性不好":["6.5"],"需要知道高度的值":["6.8"],"的值":["6.9"],"这个尚未搞清楚":["6.10"],"应该是":["6.10"],"使":["6.10"],"上下边界无限延伸至剩余空间并平分了":["6.10"],"content":["6.11"],"middle":["6.13"],"50px":["6.14"],"self":["6.17"],"大于等于":["6.19"],"left的宽度":["6.19"],"hidden":["6.20","6.26"],"触发bfc达到自适应":["6.20"],"0f0":["6.21","6.23","6.27"],"一列不定":["6.22"],"一列自适应":["6.22"],"盒子宽带随着内容增加或减少发生变化":["6.22"],"另一个盒子自适应":["6.22"],"均分":["6.24","6.27"],"parent剩余的部分":["6.24"],"触发":["6.26"],"bfc":["6.26"],"parent剩余的部分达到自适应":["6.27"],"queryselector":["9.0"],"queryselectorall":["9.0"],"这也是为什么建议使用":["10.0"],"方式来加载":["10.0"],"而不是":["10.0"],"import":["10.0"],"的方式":["10.0"],"这些语义标签":["11.1"],"删除了":["11.1"],"big":["11.1"],"font":["11.1"],"这些没有语义的标签":["11.1"],"联系信息":["11.2"],"cite":["11.2"],"标记引用的作者或来源":["11.2"]}]'},n={"0.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录后端知识点!
:::
`,l:"BackEnd/index.html",a:"编程踩坑积累与总结"},"1.0":{t:"test1",p:"",l:"Fragments/Frag1/1.html",a:"test1"},"2.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录突发奇想!
:::
`,l:"Fragments/index.html",a:"编程踩坑积累与总结"},"3.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录框架相关知识点！
:::
`,l:"Framework/index.html",a:"编程踩坑积累与总结"},"4.0":{t:"testdddd",p:"",l:"Framework/Vue/test.html",a:"testdddd"},"5.0":{t:"移动端响应式",p:`什么是响应式？
响应式就是将界面设计成能够适应不同的设备。&quot;如果将屏幕看成是容器，那么内容就像水一样&quot;
为什么要设计响应式？
首先，电脑、笔记本、手机、平板等智能设备在不断增加，其 ...`,l:"FrontEnd/CSS/响应式.html",a:"移动端响应式"},"5.1":{t:"响应式布局常用方法",p:`

使用 vm 定制 rem 自适应布局
移动端使用 rem 布局需要通过 JS 设置不同屏幕宽高比的 font-size，结合 vm 单位和 calc()可以脱离 JS 的控制
适用于 rem 布局 ...`,l:"FrontEnd/CSS/响应式.html#响应式布局常用方法",a:"响应式布局常用方法"},"6.0":{t:"css-常见布局",p:"\r",l:"FrontEnd/CSS/常见布局.html",a:"css-常见布局"},"6.1":{t:"水平布局",p:"\r",l:"FrontEnd/CSS/常见布局.html#水平布局",a:"水平布局"},"6.2":{t:"文本、行内元素、行内块级元素",p:`使用 text-align：center

优点：兼容性比较好
缺点：只对行内元素有效，且属性会继承，会影响后代行内内容，如果子元素宽度大于父元素宽度就会失效。
注意：只控制行内内容如何相对父元素对齐 ...`,l:"FrontEnd/CSS/常见布局.html#文本、行内元素、行内块级元素",a:"文本、行内元素、行内块级元素"},"6.3":{t:"单个块级元素",p:`margin:0 auto

必须定宽
优点：兼容性好
缺点：必须顶宽，值不能为 auto，宽度要小于父元素，否则无效

.son {
  width: 100px;
  margin: 0 auto ...`,l:"FrontEnd/CSS/常见布局.html#单个块级元素",a:"单个块级元素"},"6.4":{t:"多个块级元素",p:`#parent {
  text-align: center;
}
.son {
  display: inline-block; /*改为行内或者行内块级形式，以达到text-align对其生效*/ ...`,l:"FrontEnd/CSS/常见布局.html#多个块级元素",a:"多个块级元素"},"6.5":{t:"使用绝对定位",p:`#parent {
  height: 200px;
  width: 200px; /*定宽*/
  position: relative; /*父相*/
  background-color: # ...`,l:"FrontEnd/CSS/常见布局.html#使用绝对定位",a:"使用绝对定位"},"6.6":{t:"任意个元素",p:`#parent {
  display: flex;
  justify-content: center;
}


优点：简单，容易理解
缺点：PC 端兼容性不好

`,l:"FrontEnd/CSS/常见布局.html#任意个元素",a:"任意个元素"},"6.7":{t:"垂直居中",p:"\r",l:"FrontEnd/CSS/常见布局.html#垂直居中",a:"垂直居中"},"6.8":{t:"单行、行内、行内块",p:`#parent {
  height: 150px;
  line-height: 150px; /*与height等值*/
}


优点：兼容性好
缺点：只能用于单行行内内容，需要知道高度的值

`,l:"FrontEnd/CSS/常见布局.html#单行、行内、行内块",a:"单行、行内、行内块"},"6.9":{t:"多行文本、行内元素、行内块级元素",p:`#parent {
  /*或者用span把所有文字包裹起来，设置display：inline-block转换成图片的方式解决*/
  height: 150px;
  line-height: 30 ...`,l:"FrontEnd/CSS/常见布局.html#多行文本、行内元素、行内块级元素",a:"多行文本、行内元素、行内块级元素"},"6.10":{t:"单个块元素",p:`#parent {
  display: table-cell;
  vertical-align: middle;
}
- 使用 table-cell、使用绝对定位、使用 flex

/_原理：子绝 ...`,l:"FrontEnd/CSS/常见布局.html#单个块元素",a:"单个块元素"},"6.11":{t:"任意个元素",p:`#parent {
  display: flex;
  align-items: center;
}

或 #parent {
  display: flex;
}
.son {
  align-s ...`,l:"FrontEnd/CSS/常见布局.html#任意个元素",a:"任意个元素"},"6.12":{t:"水平垂直居中",p:"\r",l:"FrontEnd/CSS/常见布局.html#水平垂直居中",a:"水平垂直居中"},"6.13":{t:"行内、行内块级、图片",p:`#parent {
  height: 150px;
  line-height: 150px; /*行高的值与height相等*/
  text-align: center;
  font-size ...`,l:"FrontEnd/CSS/常见布局.html#行内、行内块级、图片",a:"行内、行内块级、图片"},"6.14":{t:"tabel-cell",p:`#parent {
  height: 150px;
  width: 200px;
  display: table-cell;
  vertical-align: middle;
  /*text ...`,l:"FrontEnd/CSS/常见布局.html#tabel-cell",a:"tabel-cell"},"6.15":{t:"绝对定位",p:`#parent {
  position: relative;
}
#son {
  position: absolute;
  top: 50%;
  left: 50%;
  /*定宽高时等同于m ...`,l:"FrontEnd/CSS/常见布局.html#绝对定位",a:"绝对定位"},"6.16":{t:"绝对居中",p:`#parent {
  position: relative;
}
#son {
  position: absolute;
  margin: auto;
  width: 100px;
  hei ...`,l:"FrontEnd/CSS/常见布局.html#绝对居中",a:"绝对居中"},"6.17":{t:"flex",p:`#parent {
  display: flex;
}
#son {
  margin: auto;
}

或 #parent {
  display: flex;
  justify-conten ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"6.18":{t:"两列布局",p:`左列定宽，右列自适应
`,l:"FrontEnd/CSS/常见布局.html#两列布局",a:"两列布局"},"6.19":{t:"float-margin",p:`&lt;body
  &gt; &lt;div
  id=&quot;left&quot;
  &gt; 左列定宽&lt;/div
  &gt; &lt;div
  id=&quot;right&qu ...`,l:"FrontEnd/CSS/常见布局.html#float-margin",a:"float-margin"},"6.20":{t:"float-overflow",p:`&lt;body&gt;
  &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt;
  &lt;div id=&quot;right&quot;&gt;右列自 ...`,l:"FrontEnd/CSS/常见布局.html#float-overflow",a:"float-overflow"},"6.21":{t:"绝对定位",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#绝对定位",a:"绝对定位"},"6.22":{t:"flex",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"6.23":{t:"float-overflow",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列不定宽&lt;/div&gt ...`,l:"FrontEnd/CSS/常见布局.html#float-overflow",a:"float-overflow"},"6.24":{t:"flex",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列不定宽&lt;/div&gt ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"6.25":{t:"三列布局",p:`两列定宽，一列自适应
`,l:"FrontEnd/CSS/常见布局.html#三列布局",a:"三列布局"},"6.26":{t:"float-margin",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#float-margin",a:"float-margin"},"6.27":{t:"flex",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"7.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录前端基础知识
:::
`,l:"FrontEnd/index.html",a:"编程踩坑积累与总结"},"9.0":{t:"h5-新特性",p:`
为了更好的实现语义化，新增了 header、footer、nav、aside、article 等语义化标签
为了方便在客户端存储和获取数据，提供了 localStorage、sessionStora ...`,l:"Interview/HTML/H5新特性.html",a:"h5-新特性"},"10.0":{t:"src",p:`
src 用于替换的当前元素
src用于指定外部资源的地址，通常用于引入外部文件，如图片、音频、视频、脚本等，指向的内容会嵌入到文档中当前标签所在的位置。
常用于&lt;img&gt;, &lt;sc ...`,l:"Interview/HTML/src和href的区别.html",a:"src"},"11.0":{t:"对语义化的理解",p:"\r",l:"Interview/HTML/语义化的理解.html",a:"对语义化的理解"},"11.1":{t:"你是怎么理解语义化的-语义化的好处",p:`我认为 html 语义化主要指的是我们应该用合适的标签来划分网页内容的结构。html 的本质作用其实就是定义网页内容的结构，一个语义化的文档，能够使页面的结构更加清晰，易于理解。
这样不仅有利于开发者 ...`,l:"Interview/HTML/语义化的理解.html#你是怎么理解语义化的-语义化的好处",a:"你是怎么理解语义化的-语义化的好处"},"11.2":{t:"常见的语义化标签有哪些",p:`
header：页眉，网站标题、导航菜单等
nav：导航部分，通常包含网站的主要导航链接
main：主要内容区域
article：内容块、比如新闻文章、博客帖子等
aside：侧边栏
footer：页 ...`,l:"Interview/HTML/语义化的理解.html#常见的语义化标签有哪些",a:"常见的语义化标签有哪些"},"12.0":{t:"面试",p:`:::tip
面试题总结与归纳!
:::
`,l:"Interview/index.html",a:"面试"},"13.0":{t:"数组",p:"",l:"Problem/Graphical/数组.html",a:"数组"},"14.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录编程遇到的问题，已经解决方案，以便以后回顾或找到更优解!
:::
`,l:"Problem/index.html",a:"编程踩坑积累与总结"},"15.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录项目中的关键技术!
:::
`,l:"Project/index.html",a:"编程踩坑积累与总结"},"16.0":{t:"测试-1",p:"",l:"Project/project1/1.html",a:"测试-1"},"17.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录面试遇到的真题!
:::
`,l:"Relay/index.html",a:"编程踩坑积累与总结"},"18.0":{t:"测试-1",p:"",l:"Relay/relay1/1.html",a:"测试-1"}},l={previewLength:100,buttonLabel:"搜索",placeholder:"情输入关键词"},e={INDEX_DATA:t,PREVIEW_LOOKUP:n,Options:l};export{e as default};
