const t={map:'[{"编程踩坑积累与总结":["0.0","2.0","3.0","6.0","11.0","12.0","14.0"],"test1":["1.0"],"移动端响应式":["4.0"],"响应式布局常用方法":["4.1"],"css":["5.0"],"水平布局":["5.1"],"文本":["5.2"],"单个块级元素":["5.3"],"多个块级元素":["5.4"],"使用绝对定位":["5.5"],"任意个元素":["5.6","5.11"],"垂直居中":["5.7"],"单行":["5.8"],"多行文本":["5.9"],"单个块元素":["5.10"],"水平垂直居中":["5.12"],"行内":["5.13"],"tabel":["5.14"],"绝对定位":["5.15","5.21"],"绝对居中":["5.16"],"flex":["5.17","5.22","5.24","5.27"],"两列布局":["5.18"],"float":["5.19","5.20","5.23","5.26"],"三列布局":["5.25"],"对语义化的理解":["8.0"],"你是怎么理解语义化的":["8.1"],"常见的语义化标签有哪些":["8.2"],"面试":["9.0"],"数组":["10.0"],"测试":["13.0","15.0"]},{"0":["5.3"],"1":["13.0","15.0"],"tip":["0.0","2.0","3.0","6.0","9.0","11.0","12.0","14.0"],"什么是响应式":["4.0"],"响应式就是将界面设计成能够适应不同的设备":["4.0"],"如果将屏幕看成是容器":["4.0"],"使用":["4.1","5.10"],"vm":["4.1"],"定制":["4.1"],"rem":["4.1"],"自适应布局":["4.1"],"移动端使用":["4.1"],"布局需要通过":["4.1"],"js":["4.1"],"设置不同屏幕宽高比的":["4.1"],"font":["4.1"],"size":["4.1"],"结合":["4.1"],"单位和":["4.1"],"calc":["4.1"],"常见布局":["5.0"],"行内元素":["5.2","5.9"],"行内块级元素":["5.2","5.9"],"margin":["5.3","5.19","5.26"],"css":["5.4","5.5","5.6","5.9","5.10","5.11","5.13","5.14","5.15","5.16","5.17","5.19"],"parent":["5.4","5.5","5.10","5.11","5.14","5.15","5.16","5.17","5.21","5.22","5.24","5.26","5.27"],"height":["5.5"],"200px":["5.5"],"width":["5.5"],"定宽":["5.5"],"行内":["5.8"],"行内块":["5.8"],"display":["5.10","5.11","5.17"],"table":["5.10"],"cell":["5.10","5.14"],"vertical":["5.10"],"align":["5.10"],"middle":["5.10"],"使用绝对定位":["5.10"],"flex":["5.10"],"原理":["5.10"],"子绝父相":["5.10"],"行内块级":["5.13"],"图片":["5.13"],"左列定宽":["5.18","5.26"],"body":["5.19","5.20","5.21","5.22","5.23","5.24","5.26","5.27"],"div":["5.19","5.20","5.21","5.22","5.23","5.24","5.26","5.27"],"overflow":["5.20","5.23"],"html":["5.20","5.21","5.22","5.23","5.24","5.26","5.27","8.1"],"id":["5.21","5.22","5.23","5.24","5.26","5.27"],"两列定宽":["5.25"],"left":["5.26"],"center":["5.26"],"中间定宽":["5.26"],"语义化的好处":["8.1"],"我认为":["8.1"],"语义化主要指的是我们应该用合适的标签来划分网页内容的结构":["8.1"],"的本质作用其实就是定义网页内容的结构":["8.1"],"header":["8.2"],"页眉":["8.2"],"网站标题":["8.2"]},{"10":["5.26"],"100":["5.26"],"200":["5.26"],"这里主要记录后端知识点":["0.0"],"这里主要记录突发奇想":["2.0"],"这里主要记录框架相关知识点":["3.0"],"那么内容就像水一样":["4.0"],"为什么要设计响应式":["4.0"],"首先":["4.0"],"可以脱离":["4.1"],"的控制":["4.1"],"适用于":["4.1"],"布局":["4.1"],"nth":["4.1"],"child":["4.1"],"选择指定元素":["4.1"],"通过":["4.1"],"筛选指定的元素设置样式":["4.1"],"适用于表格着色":["4.1"],"边界元素排版":["4.1"],"使用":["5.2"],"text":["5.2","5.4"],"align":["5.2","5.4","5.11"],"auto":["5.3","5.17"],"必须定宽":["5.3"],"优点":["5.3"],"center":["5.4","5.27"],"position":["5.5","5.10","5.15","5.16"],"relative":["5.5","5.10","5.15","5.16"],"父相":["5.5","5.10"],"background":["5.5"],"color":["5.5"],"f00":["5.5"],"son":["5.5","5.15","5.16","5.17"],"parent":["5.6","5.8","5.9","5.13","5.23"],"display":["5.6"],"css":["5.8","5.26"],"或者用span把所有文字包裹起来":["5.9"],"设置display":["5.9"],"top":["5.10"],"right":["5.10","5.21","5.26"],"bottom":["5.10"],"left":["5.10","5.19","5.20","5.21","5.22","5.23","5.24","5.27"],"的值是相对于父元素尺寸的":["5.10"],"然后":["5.10"],"margin":["5.10","5.17"],"或者":["5.10"],"transform":["5.10"],"是相对于自身尺寸的":["5.10"],"组合使用达到水平居中的目的":["5.10"],"height":["5.10","5.13","5.14"],"150px":["5.10","5.13","5.14"],"flex":["5.11"],"items":["5.11"],"width":["5.14","5.26"],"右列自适应":["5.18","5.26"],"id":["5.19","5.20"],"左列定宽":["5.19","5.20","5.21","5.22","5.27"],"左列不定宽":["5.23","5.24"],"一列自适应":["5.25"],"min":["5.26"],"310px":["5.26"],"防止宽度不够":["5.26"],"子元素换行":["5.26"],"10px":["5.26"],"中间定宽":["5.27"],"这里主要记录前端基础知识":["6.0"],"一个语义化的文档":["8.1"],"能够使页面的结构更加清晰":["8.1"],"易于理解":["8.1"],"这样不仅有利于开发者的阅读和理解":["8.1"],"同时也能够使机器对文档内容进行正确的解读":["8.1"],"比如说我们常用的":["8.1"],"导航菜单等":["8.2"],"nav":["8.2"],"导航部分":["8.2"],"通常包含网站的主要导航链接":["8.2"],"面试题总结与归纳":["9.0"],"这里主要记录编程遇到的问题":["11.0"],"这里主要记录项目中的关键技术":["12.0"],"这里主要记录面试遇到的真题":["14.0"]},{"50":["5.5","5.10"],"电脑":["4.0"],"笔记本":["4.0"],"手机":["4.0"],"平板等智能设备在不断增加":["4.0"],"writing":["4.1"],"mode":["4.1"],"排版竖文":["4.1"],"调整文本排版方向":["4.1"],"适用于竖行文字":["4.1"],"文言文":["4.1"],"诗词":["4.1"],"text":["4.1"],"align":["4.1"],"last":["4.1"],"对齐两端文本":["4.1"],"设置文本两端对齐":["4.1"],"center":["5.2","5.11"],"优点":["5.2"],"兼容性比较好":["5.2"],"兼容性好":["5.3"],"缺点":["5.3"],"son":["5.4","5.10"],"display":["5.4","5.14"],"inline":["5.4","5.9"],"absolute":["5.5","5.10","5.15","5.16"],"子绝":["5.5","5.10"],"left":["5.5"],"父元素宽度一半":["5.5"],"这里等同于left":["5.5"],"100px":["5.5","5.26"],"flex":["5.6"],"justify":["5.6"],"height":["5.8","5.9","5.26"],"150px":["5.8","5.9"],"block转换成图片的方式解决":["5.9"],"父元素高度一半":["5.10"],"这里等同于":["5.10"],"75px":["5.10"],"translatey":["5.10"],"自身高度一半":["5.10"],"或":["5.11","5.17"],"line":["5.13"],"行高的值与height相等":["5.13"],"200px":["5.14","5.26"],"table":["5.14"],"top":["5.15"],"margin":["5.16"],"right":["5.19","5.20","5.22","5.23","5.24","5.27"],"右列自适应":["5.19","5.20","5.21","5.22","5.23","5.24","5.27"],"css":["5.21"],"position":["5.21"],"left和":["5.26"],"center间隔":["5.26"],"500px":["5.26"],"background":["5.26"],"color":["5.26"],"f00":["5.26"],"b":["8.1"],"和":["8.1"],"strong":["8.1"],"标签":["8.1"],"它们在样式上都是文字的加粗":["8.1"],"但是":["8.1"],"main":["8.2"],"主要内容区域":["8.2"],"article":["8.2"],"已经解决方案":["11.0"]},{"50":["5.15"],"100":["5.22"],"其次":["4.0"],"就算是都使用的":["4.0"],"pc":["4.0"],"适用于未知字数中文对齐":["4.1"],"not":["4.1"],"去除无用属性":["4.1"],"排除指定元素不使用样式":["4.1"],"适用于符号分割文字":["4.1"],"object":["4.1"],"fit":["4.1"],"规定图像尺寸":["4.1"],"使图像脱离":["4.1"],"background":["4.1","5.19","5.20"],"缺点":["5.2","5.10"],"只对行内元素有效":["5.2"],"必须顶宽":["5.3"],"值不能为":["5.3"],"block":["5.4"],"改为行内或者行内块级形式":["5.4"],"以达到text":["5.4"],"transform":["5.5"],"translatex":["5.5"],"自身宽度一半":["5.5"],"等同于margin":["5.5"],"50px":["5.5","5.10"],"content":["5.6","5.17"],"center":["5.6","5.13","5.17"],"line":["5.8","5.9"],"30px":["5.9"],"25px":["5.10"],"优缺点":["5.10"],"优点":["5.10"],"兼容性好":["5.10"],"不管是块级还是行内元素都可以实现":["5.10"],"代码较多":["5.10"],"脱离文档流":["5.10"],"需要知道高度值":["5.10"],"son":["5.11"],"text":["5.13"],"align":["5.13","5.14"],"vertical":["5.14"],"middle":["5.14"],"left":["5.15"],"auto":["5.16"],"width":["5.16","5.22"],"100px":["5.16"],"justify":["5.17"],"color":["5.19"],"f00":["5.19"],"css":["5.20","5.22","5.23","5.24","5.27"],"relative":["5.21"],"子绝父相":["5.21"],"absolute":["5.21"],"top":["5.21"],"margin":["5.23"],"display":["5.24","5.27"],"eeff2b":["5.26"],"320px":["5.26"],"等于":["5.26"],"center的宽度之和加上间隔":["5.26"],"多出来的就是":["5.26"],"right和":["5.26"],"center的间隔":["5.26"],"0f0":["5.26"],"height":["5.27"],"500px":["5.27"],"标签具有强调的语义":["8.1"],"对于一般显示":["8.1"],"可能看上去没有什么差异":["8.1"],"但是对于机器来说":["8.1"],"会有很大的不同":["8.1"],"如果用户使用的是屏幕阅读器来访问网页":["8.1"],"内容块":["8.2"],"比如新闻文章":["8.2"],"博客帖子等":["8.2"],"aside":["8.2"],"以便以后回顾或找到更优解":["11.0"]},{"0":["5.10","5.13","5.21"],"端":["4.0"],"用户是否将浏览器全屏也是个问题":["4.0"],"不同屏幕分辨率也不同":["4.0"],"的约束":["4.1"],"img":["4.1"],"来标记图像背景尺寸":["4.1"],"适用于图片尺寸自适应":["4.1"],"overflow":["4.1","5.26"],"x":["4.1"],"排版横向列表":["4.1"],"flexbox":["4.1"],"或":["4.1","5.10"],"inline":["4.1"],"block":["4.1"],"的形式横行排列元素":["4.1"],"且属性会继承":["5.2"],"会影响后代行内内容":["5.2"],"如果子元素宽度大于父元素宽度就会失效":["5.2"],"宽度要小于父元素":["5.3"],"否则无效":["5.3"],"css":["5.3"],"align对其生效":["5.4"],"优点":["5.4","5.6"],"兼容性好":["5.4"],"00ff00":["5.5"],"简单":["5.6"],"与height等值":["5.8"],"元素在页面呈现为5行":["5.9"],"则line":["5.9"],"height的值为height":["5.9"],"兼容性不好":["5.10"],"ie9":["5.10"],"当":["5.10"],"为":["5.10"],"时":["5.10"],"会无限延伸占满空间并且平分":["5.10"],"self":["5.11"],"font":["5.13"],"size":["5.13"],"text":["5.14"],"center":["5.14"],"如果是行内元素就添加这个":["5.14"],"定宽高时等同于margin":["5.15"],"负自身宽度一半":["5.15"],"height":["5.16","5.19","5.22"],"50px":["5.16"],"top":["5.16"],"align":["5.17"],"items":["5.17"],"width":["5.19","5.20","5.21","5.27"],"100px":["5.19","5.27"],"color":["5.20","5.21"],"f00":["5.20","5.21"],"background":["5.21","5.27"],"500px":["5.22"],"display":["5.22"],"10px":["5.23","5.24","5.27"],"只设置浮动":["5.23"],"不设宽度":["5.24"],"margin":["5.24","5.27"],"间距":["5.27"],"使用":["8.1"],"就会有明显的语调上的变化":["8.1"],"标签则没有":["8.1"],"如果是搜索引擎的爬虫对我们的网页进行分析的话":["8.1"],"它会依赖":["8.1"],"侧边栏":["8.2"],"footer":["8.2"],"页脚":["8.2"],"figure":["8.2"]},{"0":["5.14","5.16"],"5":["5.9"],"20":["5.26"],"同一张图片在不同的设备上":["4.0"],"大小可能天差地别":["4.0"],"响应式界面的标准是什么":["4.0"],"同一页面在不同大小和比例上看起来都应该是舒适的":["4.0"],"对父元素设置":["4.1"],"auto":["4.1","5.10"],"横行滚动查看":["4.1"],"适用于横行滚动列表":["4.1"],"元素过多但位置有限的导航栏":["4.1"],"控制文本溢出":["4.1"],"适用于单行文字":["4.1"],"多行文字溢出":["4.1"],"transform":["4.1"],"描绘":["4.1"],"1px":["4.1"],"注意":["5.2"],"只控制行内内容如何相对父元素对齐":["5.2"],"css":["5.2"],"son":["5.3","5.13","5.14"],"width":["5.3"],"缺点":["5.4","5.6","5.9"],"只对行内元素有效":["5.4"],"属性会继承影响到后代行内内容":["5.4"],"子绝父相":["5.5"],"top":["5.5"],"bottom":["5.5","5.16"],"right":["5.5"],"是相对于父元素尺寸的":["5.5"],"margin":["5.5","5.14","5.15"],"容易理解":["5.6"],"优点":["5.8","5.9"],"兼容性好":["5.8","5.9"],"简单":["5.10"],"消除幽灵空白节点的bug":["5.13"],"display":["5.13"],"inline":["5.13"],"负自身高度一半":["5.15"],"500px":["5.19","5.20","5.21","5.23","5.24"],"100px":["5.20","5.21","5.22"],"height":["5.20","5.21","5.23","5.24"],"background":["5.22","5.23","5.24"],"color":["5.22","5.23","5.24","5.27"],"f00":["5.22","5.23","5.24","5.27"],"不设宽度":["5.23"],"标签来确定上下文和各个关键字的权重":["8.1"],"一个语义化的文档对爬虫来说是友好的":["8.1"],"是有利于爬虫对文档内容解读的":["8.1"],"从而有利于网站的":["8.1"],"seo":["8.1"],"表示一组媒体内容":["8.2"],"一般包括图像":["8.2"],"图表":["8.2"]},{"1":["5.22"],"同一页面在不同分辨率上看起来应该合理":["4.0"],"同一页面在不同操作方式下":["4.0"],"体验应该是统一的":["4.0"],"边框":["4.1"],"适用于容器":["4.1"],"翻转内容":["4.1"],"scale3d":["4.1"],"对内容进行翻转":["4.1"],"适用于内容翻转":["4.1"],"letter":["4.1"],"spacing":["4.1"],"排版倒序文本":["4.1"],"parent":["5.2"],"100px":["5.3","5.14"],"块级元素改为":["5.4"],"或":["5.5"],"是相对于自身尺寸的":["5.5"],"组合使用达到水平居中的目的":["5.5"],"优点":["5.5"],"使用":["5.5"],"pc":["5.6"],"端兼容性不好":["5.6"],"缺点":["5.8"],"只能用于单行行内内容":["5.8"],"只能用于行内内容":["5.9"],"需要知道高度和最终呈现多少行来计算出":["5.9"],"兼容性较好":["5.10"],"ie8":["5.10"],"items":["5.10"],"center":["5.10"],"self":["5.10"],"direction":["5.11"],"column":["5.11"],"justify":["5.11"],"block":["5.13"],"如果是块级元素需改为行内或行内块级才生效":["5.13"],"vertical":["5.13"],"auto":["5.14"],"如果是块级元素就添加这个":["5.14"],"transform":["5.15"],"translate":["5.15"],"left":["5.16"],"right":["5.16"],"0f0":["5.19","5.20","5.22","5.24"],"值大于等于":["5.21"],"left的宽度":["5.21"],"均分了父元素剩余空间":["5.22"],"hidden":["5.23"],"触发bfc":["5.23"],"间隔":["5.26"],"在此定义和":["5.26"],"的间隔":["5.26"],"200px":["5.27"],"eeff2b":["5.27"],"从":["8.1"],"html5":["8.1"],"可以看出":["8.1"],"标准是倾向于以语义化的方式构建网页的":["8.1"],"比如新增了":["8.1"],"header":["8.1"],"footer":["8.1"],"视频等":["8.2"],"abbr":["8.2"],"缩写词":["8.2"],"address":["8.2"]},{"1":["5.24","5.27"],"同一页面在不同类型的设备上":["4.0"],"交互方式应该是符合习惯的":["4.0"],"设置负值字体间距将文本倒序":["4.1"],"适用于文言文":["4.1"],"margin":["4.1"],"left":["4.1"],"排版左重右轻列表":["4.1"],"横行布局时":["4.1"],"最后一个元素通过设置":["4.1"],"实现向右对齐":["4.1"],"适用于右侧带图标的导航栏":["4.1"],"换行":["5.4"],"空格会产生元素间隔":["5.4"],"兼容性好":["5.5"],"不管是块级还是行内都能实现":["5.5"],"缺点":["5.5"],"代码较多":["5.5"],"脱离文档流":["5.5"],"兼容性不好":["5.5"],"需要知道高度的值":["5.8"],"的值":["5.9"],"这个尚未搞清楚":["5.10"],"应该是":["5.10"],"使":["5.10"],"上下边界无限延伸至剩余空间并平分了":["5.10"],"content":["5.11"],"middle":["5.13"],"50px":["5.14"],"self":["5.17"],"大于等于":["5.19"],"left的宽度":["5.19"],"hidden":["5.20","5.26"],"触发bfc达到自适应":["5.20"],"0f0":["5.21","5.23","5.27"],"一列不定":["5.22"],"一列自适应":["5.22"],"盒子宽带随着内容增加或减少发生变化":["5.22"],"另一个盒子自适应":["5.22"],"均分":["5.24","5.27"],"parent剩余的部分":["5.24"],"触发":["5.26"],"bfc":["5.26"],"parent剩余的部分达到自适应":["5.27"],"这些语义标签":["8.1"],"删除了":["8.1"],"big":["8.1"],"font":["8.1"],"这些没有语义的标签":["8.1"],"联系信息":["8.2"],"cite":["8.2"],"标记引用的作者或来源":["8.2"]}]'},n={"0.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录后端知识点!
:::
`,l:"BackEnd/index.html",a:"编程踩坑积累与总结"},"1.0":{t:"test1",p:"",l:"Fragments/Frag1/1.html",a:"test1"},"2.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录突发奇想!
:::
`,l:"Fragments/index.html",a:"编程踩坑积累与总结"},"3.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录框架相关知识点！
:::
`,l:"Framework/index.html",a:"编程踩坑积累与总结"},"4.0":{t:"移动端响应式",p:`什么是响应式？
响应式就是将界面设计成能够适应不同的设备。&quot;如果将屏幕看成是容器，那么内容就像水一样&quot;
为什么要设计响应式？
首先，电脑、笔记本、手机、平板等智能设备在不断增加，其 ...`,l:"FrontEnd/CSS/响应式.html",a:"移动端响应式"},"4.1":{t:"响应式布局常用方法",p:`

使用 vm 定制 rem 自适应布局
移动端使用 rem 布局需要通过 JS 设置不同屏幕宽高比的 font-size，结合 vm 单位和 calc()可以脱离 JS 的控制
适用于 rem 布局 ...`,l:"FrontEnd/CSS/响应式.html#响应式布局常用方法",a:"响应式布局常用方法"},"5.0":{t:"css-常见布局",p:"\r",l:"FrontEnd/CSS/常见布局.html",a:"css-常见布局"},"5.1":{t:"水平布局",p:"\r",l:"FrontEnd/CSS/常见布局.html#水平布局",a:"水平布局"},"5.2":{t:"文本、行内元素、行内块级元素",p:`使用 text-align：center

优点：兼容性比较好
缺点：只对行内元素有效，且属性会继承，会影响后代行内内容，如果子元素宽度大于父元素宽度就会失效。
注意：只控制行内内容如何相对父元素对齐 ...`,l:"FrontEnd/CSS/常见布局.html#文本、行内元素、行内块级元素",a:"文本、行内元素、行内块级元素"},"5.3":{t:"单个块级元素",p:`margin:0 auto

必须定宽
优点：兼容性好
缺点：必须顶宽，值不能为 auto，宽度要小于父元素，否则无效

.son {
  width: 100px;
  margin: 0 auto ...`,l:"FrontEnd/CSS/常见布局.html#单个块级元素",a:"单个块级元素"},"5.4":{t:"多个块级元素",p:`#parent {
  text-align: center;
}
.son {
  display: inline-block; /*改为行内或者行内块级形式，以达到text-align对其生效*/ ...`,l:"FrontEnd/CSS/常见布局.html#多个块级元素",a:"多个块级元素"},"5.5":{t:"使用绝对定位",p:`#parent {
  height: 200px;
  width: 200px; /*定宽*/
  position: relative; /*父相*/
  background-color: # ...`,l:"FrontEnd/CSS/常见布局.html#使用绝对定位",a:"使用绝对定位"},"5.6":{t:"任意个元素",p:`#parent {
  display: flex;
  justify-content: center;
}


优点：简单，容易理解
缺点：PC 端兼容性不好

`,l:"FrontEnd/CSS/常见布局.html#任意个元素",a:"任意个元素"},"5.7":{t:"垂直居中",p:"\r",l:"FrontEnd/CSS/常见布局.html#垂直居中",a:"垂直居中"},"5.8":{t:"单行、行内、行内块",p:`#parent {
  height: 150px;
  line-height: 150px; /*与height等值*/
}


优点：兼容性好
缺点：只能用于单行行内内容，需要知道高度的值

`,l:"FrontEnd/CSS/常见布局.html#单行、行内、行内块",a:"单行、行内、行内块"},"5.9":{t:"多行文本、行内元素、行内块级元素",p:`#parent {
  /*或者用span把所有文字包裹起来，设置display：inline-block转换成图片的方式解决*/
  height: 150px;
  line-height: 30 ...`,l:"FrontEnd/CSS/常见布局.html#多行文本、行内元素、行内块级元素",a:"多行文本、行内元素、行内块级元素"},"5.10":{t:"单个块元素",p:`#parent {
  display: table-cell;
  vertical-align: middle;
}
- 使用 table-cell、使用绝对定位、使用 flex

/_原理：子绝 ...`,l:"FrontEnd/CSS/常见布局.html#单个块元素",a:"单个块元素"},"5.11":{t:"任意个元素",p:`#parent {
  display: flex;
  align-items: center;
}

或 #parent {
  display: flex;
}
.son {
  align-s ...`,l:"FrontEnd/CSS/常见布局.html#任意个元素",a:"任意个元素"},"5.12":{t:"水平垂直居中",p:"\r",l:"FrontEnd/CSS/常见布局.html#水平垂直居中",a:"水平垂直居中"},"5.13":{t:"行内、行内块级、图片",p:`#parent {
  height: 150px;
  line-height: 150px; /*行高的值与height相等*/
  text-align: center;
  font-size ...`,l:"FrontEnd/CSS/常见布局.html#行内、行内块级、图片",a:"行内、行内块级、图片"},"5.14":{t:"tabel-cell",p:`#parent {
  height: 150px;
  width: 200px;
  display: table-cell;
  vertical-align: middle;
  /*text ...`,l:"FrontEnd/CSS/常见布局.html#tabel-cell",a:"tabel-cell"},"5.15":{t:"绝对定位",p:`#parent {
  position: relative;
}
#son {
  position: absolute;
  top: 50%;
  left: 50%;
  /*定宽高时等同于m ...`,l:"FrontEnd/CSS/常见布局.html#绝对定位",a:"绝对定位"},"5.16":{t:"绝对居中",p:`#parent {
  position: relative;
}
#son {
  position: absolute;
  margin: auto;
  width: 100px;
  hei ...`,l:"FrontEnd/CSS/常见布局.html#绝对居中",a:"绝对居中"},"5.17":{t:"flex",p:`#parent {
  display: flex;
}
#son {
  margin: auto;
}

或 #parent {
  display: flex;
  justify-conten ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"5.18":{t:"两列布局",p:`左列定宽，右列自适应
`,l:"FrontEnd/CSS/常见布局.html#两列布局",a:"两列布局"},"5.19":{t:"float-margin",p:`&lt;body
  &gt; &lt;div
  id=&quot;left&quot;
  &gt; 左列定宽&lt;/div
  &gt; &lt;div
  id=&quot;right&qu ...`,l:"FrontEnd/CSS/常见布局.html#float-margin",a:"float-margin"},"5.20":{t:"float-overflow",p:`&lt;body&gt;
  &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt;
  &lt;div id=&quot;right&quot;&gt;右列自 ...`,l:"FrontEnd/CSS/常见布局.html#float-overflow",a:"float-overflow"},"5.21":{t:"绝对定位",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#绝对定位",a:"绝对定位"},"5.22":{t:"flex",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"5.23":{t:"float-overflow",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列不定宽&lt;/div&gt ...`,l:"FrontEnd/CSS/常见布局.html#float-overflow",a:"float-overflow"},"5.24":{t:"flex",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列不定宽&lt;/div&gt ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"5.25":{t:"三列布局",p:`两列定宽，一列自适应
`,l:"FrontEnd/CSS/常见布局.html#三列布局",a:"三列布局"},"5.26":{t:"float-margin",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#float-margin",a:"float-margin"},"5.27":{t:"flex",p:`&lt;body&gt;
  &lt;div id=&quot;parent&quot;&gt;
    &lt;div id=&quot;left&quot;&gt;左列定宽&lt;/div&gt; ...`,l:"FrontEnd/CSS/常见布局.html#flex",a:"flex"},"6.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录前端基础知识
:::
`,l:"FrontEnd/index.html",a:"编程踩坑积累与总结"},"8.0":{t:"对语义化的理解",p:"\r",l:"Interview/HTML/语义化的理解.html",a:"对语义化的理解"},"8.1":{t:"你是怎么理解语义化的-语义化的好处",p:`我认为 html 语义化主要指的是我们应该用合适的标签来划分网页内容的结构。html 的本质作用其实就是定义网页内容的结构，一个语义化的文档，能够使页面的结构更加清晰，易于理解。
这样不仅有利于开发者 ...`,l:"Interview/HTML/语义化的理解.html#你是怎么理解语义化的-语义化的好处",a:"你是怎么理解语义化的-语义化的好处"},"8.2":{t:"常见的语义化标签有哪些",p:`
header：页眉，网站标题、导航菜单等
nav：导航部分，通常包含网站的主要导航链接
main：主要内容区域
article：内容块、比如新闻文章、博客帖子等
aside：侧边栏
footer：页 ...`,l:"Interview/HTML/语义化的理解.html#常见的语义化标签有哪些",a:"常见的语义化标签有哪些"},"9.0":{t:"面试",p:`:::tip
面试题总结与归纳!
:::
`,l:"Interview/index.html",a:"面试"},"10.0":{t:"数组",p:"",l:"Problem/Graphical/数组.html",a:"数组"},"11.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录编程遇到的问题，已经解决方案，以便以后回顾或找到更优解!
:::
`,l:"Problem/index.html",a:"编程踩坑积累与总结"},"12.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录项目中的关键技术!
:::
`,l:"Project/index.html",a:"编程踩坑积累与总结"},"13.0":{t:"测试-1",p:"",l:"Project/project1/1.html",a:"测试-1"},"14.0":{t:"编程踩坑积累与总结",p:`::: tip
这里主要记录面试遇到的真题!
:::
`,l:"Relay/index.html",a:"编程踩坑积累与总结"},"15.0":{t:"测试-1",p:"",l:"Relay/relay1/1.html",a:"测试-1"}},l={previewLength:100,buttonLabel:"搜索",placeholder:"情输入关键词"},e={INDEX_DATA:t,PREVIEW_LOOKUP:n,Options:l};export{e as default};
